<?php

namespace App\Http\Controllers\Api;

use App\Http\Controllers\Controller;
use App\Models\Cars;
use Illuminate\Http\Request;
use App\Http\Requests\Api\CarPriceRequest;
use QL\QueryList;

class CarPriceController extends Controller
{
    public function CarPrice(CarPriceRequest $request)
    {
        $carname = $request->carname;

        $IsCity = $this->CheckCity($carname);

        $pricereply = '抱歉，后台数据库还在升级中，暂时没有您所查询的车系信息，请尝试其他车系。如不知道车系，可以先尝试输入车辆品牌，比如输入阿斯顿，可以获取阿斯顿·马丁旗下所有车系';

        if ('false' == $IsCity)
        {
            $cars = Cars::where('name', $carname)->first();

            if (!$cars)
            {
                $count = Cars::where('name', 'like','%'.$carname.'%')->count();
                if ($count != 0)
                {
                    $carbrand = Cars::where('name', 'like','%'.$carname.'%')->get();
                    $pricereply = '您所查询的品牌旗下所有车系为:';
                    for($i = 0; $i < $count; $i++)
                    {
                        $pricereply = $pricereply.$carbrand[$i]->name.';';
                    }

                    $pricereply = $pricereply.' 您可以复制具体车系名称，输入至对话框查询该车系价格范围。';
                }
                return $pricereply;
            }
            else
            {
                if (0 == $cars->minprice) {
                    return '抱歉，您所查询的车系暂时没有报价，请尝试其他车系。';
                }
                else
                {
                    $pricereply = $carname.' 厂家指导价为:'.$cars->minprice.' 至 '.$cars->maxprice.'元';
                }
            }
        }


        return $pricereply;

    }

    public function CheckCity($CityName)
    {
        $result = 'true';

        $CitySet = '鞍山;安阳;安庆;安康;安顺;阿坝;阿克苏;阿里;阿拉尔;阿拉善盟;澳门;安达;安丘;安宁;安国;阿尔山;阿图什;安陆;北京;保定;包头;滨州;宝鸡;蚌埠;本溪;北海;巴音郭楞;巴中;巴彦淖尔市;亳州;白银;白城;百色;白山;博尔塔拉;毕节;保山;霸州;北安;北票;泊头;博乐;北流;成都;重庆;长沙;常州;长春;沧州;昌吉;赤峰;常德;郴州;承德;长治;池州;滁州;朝阳;潮州;楚雄;巢湖;昌都;长葛;崇左;常熟;昌邑;常宁;赤壁;岑溪;赤水;慈溪;崇州;大连;东莞;德阳;大理;德州;东营;大庆;丹东;大同;达州;大丰;德宏;定州;迪庆;定西;大兴安岭;东台;邓州;德惠;当阳;东方;儋州;敦化;丹阳;大石桥;灯塔;敦煌;德令哈;大冶;都匀;东兴;东阳;德兴;丹江口;都江堰;东港;登封;鄂尔多斯;恩施;鄂州;恩平;峨眉山;佛山;福州;阜阳;抚顺;阜新;抚州;防城港;肥城;丰城;丰镇;汾阳;阜康;福泉;福清;福安;凤城;福鼎;广州;贵阳;桂林;赣州;广安;贵港;广元;甘孜;甘南;馆陶;果洛;固原;公主岭;高邮;高密;广水;盖州;格尔木;广汉;个旧;桂平;贵溪;高安;高州;高要;古交;高碑店;杭州;合肥;哈尔滨;海口;惠州;邯郸;呼和浩特;黄冈;淮南;黄山;鹤壁;衡阳;湖州;衡水;汉中;淮安;黄石;菏泽;怀化;淮北;葫芦岛;河源;红河;哈密;鹤岗;呼伦贝尔;海北;海东;海南;河池;黑河;和县;贺州;海拉尔;霍邱;和田;黄南;海西;桦甸;鹤山;海林;海城;珲春;黄骅;河间;韩城;华阴;侯马;汉川;华蓥;合山;辉县;化州;霍州;洪湖;洪江;和龙;海门;海宁;海阳;济南;嘉兴;吉林;江门;荆门;锦州;景德镇;吉安;济宁;金华;揭阳;晋中;九江;焦作;晋城;荆州;佳木斯;酒泉;鸡西;济源;金昌;嘉峪关;江阴;靖江;简阳;金坛;津市;界首;吉首;景洪;晋江;建瓯;江山;井冈山;蛟河;胶州;句容;建德;冀州;江油市;昆明;昆山;开封;喀什;克拉玛依;垦利;克孜勒苏;库尔勒;奎屯;凯里;开平;开原;开远;兰州;廊坊;洛阳;柳州;莱芜;六安;泸州;丽江;临沂;聊城;连云港;丽水;娄底;乐山;辽阳;拉萨;临汾;龙岩;漯河;凉山;六盘水;辽源;来宾;临沧;临夏;临猗;林芝;陇南;吕梁;临海;龙海;醴陵;临清;龙口;莱阳;耒阳;溧阳;龙井;临江;凌源;林州;灵宝;潞城;利川;冷水江;涟源;阆中;潞西;兰溪;乐昌;廉江;雷州;陆丰;连州;罗定;临湘;龙泉;乐平;乐陵;莱州;浏阳;老河口;莱西;绵阳;茂名;马鞍山;牡丹江;眉山;梅州;明港;密山;梅河口;满洲里;孟州;麻城;绵竹;明光;汨罗;南京;宁波;南昌;南宁;南通;南充;南阳;宁德;内江;南平;那曲;怒江;南安;宁安;宁国;南康;南雄;讷河;南宫;攀枝花;平顶山;盘锦;萍乡;濮阳;莆田;普洱;平凉;普宁;普兰店;凭祥;邳州;蓬莱;平湖;平度;彭州;青岛;秦皇岛;泉州;曲靖;齐齐哈尔;衢州;清远;钦州;庆阳;黔东南;潜江;清徐;黔南;七台河;黔西南;迁安;青州;清镇;琼海;青铜峡;沁阳;曲阜;邛崃;启东;日照;日喀则;瑞安;汝州;任丘;瑞金;乳山;仁怀;瑞昌;瑞丽;如皋;荣成市;上海;深圳;苏州;石家庄;沈阳;三亚;绍兴;汕头;十堰;三门峡;三明;韶关;商丘;宿迁;绥化;邵阳;遂宁;上饶;四平;石河子;顺德;宿州;松原;沭阳;石嘴山;随州;朔州;汕尾;三沙;商洛;山南;神农架;双鸭山;石狮;三河;尚志;寿光;嵊州;绥芬河;什邡;四会;邵武;松滋;石首;韶山;深州;沙河;天津;太原;泰州;唐山;泰安;台州;铁岭;通辽;铜陵;天水;通化;台山;铜川;吐鲁番;天门;图木舒克;桐城;铜仁;台湾;太仓;泰兴;滕州;洮南;铁力;桐乡;天长;武汉;无锡;威海;潍坊;乌鲁木齐;温州;芜湖;梧州;渭南;乌海;文山;武威;乌兰察布;瓦房店;五家渠;武夷山;吴忠;五指山;温岭;武安;舞钢;五常;卫辉;武冈;文昌;五大连池;乌兰浩特;武穴;万源;吴川;万宁;西安;厦门;徐州;湘潭;襄阳;新乡;信阳;咸阳;邢台;孝感;西宁;许昌;忻州;宣城;咸宁;兴安盟;新余;西双版纳;香港;湘西;仙桃;锡林郭勒盟;新泰;新乐;湘乡;锡林浩特;辛集;新民;兴化;兴平;兴义;宣威;兴宁;项城;信宜;孝义;兴城;新沂;荥阳;新郑;新密;烟台;扬州;宜昌;银川;阳江;永州;玉林;盐城;岳阳;运城;宜春;营口;榆林;宜宾;益阳;义乌;玉溪;伊犁;阳泉;延安;鹰潭;延边;云浮;雅安;阳春;鄢陵;伊春;玉树;乐清;禹州;永新;永康;榆树;永安;宜都;仪征;延吉;扬中;牙克石;伊宁;永济;应城;宜州;英德;玉门;禹城;余姚;偃师;永城;宜兴;宜城;沅江;郑州;珠海;中山;镇江;淄博;张家口;株洲;漳州;湛江;肇庆;枣庄;舟山;遵义;驻马店;自贡;资阳;周口;章丘;张家界;诸城;庄河;正定;张北;张掖;昭通;中卫;赵县;邹城;遵化;肇东;张家港;枝江;招远;钟祥;资兴;樟树;扎兰屯;诸暨;涿州;枣阳;漳平;阿坝州;大邑;金堂;栖霞;淳安;富阳;临安;桐庐;铜梁;丰都;长寿;涪陵;南川;永川;綦江;黔江;万州;江津;合川;普兰店;平阴;济阳;商河;中牟;巩义;宁乡;无极;辛集;元氏;即墨;胶南;周至;户县;蓝田;宁海;象山;肥东;肥西;庐江;长丰;长乐;连江;平潭;安宁;宜良;清镇;辽中;新民;进贤;新建;溧阳;嘉善;莱阳;龙口;招远;白沙县;儋州市;澄迈县;定安;琼中;屯昌;文昌市;农安;陵水;琼海;保亭;东方市;博罗;惠东;龙门;昌邑;永登;榆中;文安;孟津;汝阳;新安;伊川;宜阳;宾阳;横县;海安;启东;如东;安溪;惠安;永春;晋安;上虞;兴化;乐亭;滦南;滦县;迁西;玉田;安丘;昌乐;高密;青州;寿光;丰县;沛县;睢宁;宝应;高邮;江都;仪征;当阳;宜都;枝江;丹阳市;扬中市;邹平;广饶;玉环;肇源;东海;德清;长兴;建湖;当涂;宁国;巴州';

        if (strlen($CityName) > 6)
        {
            $CityName = substr($CityName,0,6);
            //$CityName = iconv("UTF-8","gb2312//IGNORE",$CityName);
        }

        if (false == strpos($CitySet, $CityName))
        {
            $result = 'false';
        }
        return $result;
    }
}
